ticketing_application/app/views/tickets/_form.html.erb

    <label for="project">Project</label>
    <%=select("ticket", "project_id", Project.all.collect { |p| [ p.name, p.id ] }, { prompt: true })%>
---
SELECT "tickets".* FROM "tickets"
SELECT "projects".* FROM "projects"

    <%= f.label :assignee %>
    <%=select(:ticket, :assignee_id, User.all.collect { |p| [ p.name, p.id ] }, { prompt: true })%>
---
SELECT "users".* FROM "users"

    <%= f.label :tag %>
    <%= collection_select(:ticket, :tag_ids, Tag.all, :id, :name, {}, {multiple: true})%>
---
SELECT "tags".* FROM "tags"