ticketing_application/app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "A new project"], ["description", "This is a new thing"], ["created_at", "2019-12-31 07:02:15.641643"], ["updated_at", "2019-12-31 07:02:15.641643"]]
---
  def create
    @project = Project.new(project_params)

    if @project.save

UPDATE "projects" SET "name" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "give big kiss"], ["updated_at", "2019-12-31 01:08:41.882625"], ["id", 13]]
---
  def update
    if @project.update(project_params)

DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 12]]
---
  def destroy
    if @project.destroy