ticketing_application/app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags"
---
  def index
    @tags = Tag.all

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Rails"], ["created_at", "2019-12-30 23:52:42.602067"], ["updated_at", "2019-12-30 23:52:42.602067"]]
---
  def create
    @tag = Tag.new(tag_params)

    if @tag.save

UPDATE "tags" SET "name" = ?, "updated_at" = ? WHERE "tags"."id" = ?  [["name", "Ruby"], ["updated_at", "2019-12-28 23:53:22.705272"], ["id", 1]]
---
  def update
    if @tag.update(tag_params)

DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]
---
  def destroy
    if @tag.destroy

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_tag
    @tag = Tag.find(params[:id])