ticketing_application/app/helpers/application_helper.rb

SELECT "projects".* FROM "projects"
---
  def project_names
    Project.all.map {|p| p.name}

SELECT "tags".* FROM "tags" INNER JOIN "ticket_tags" ON "tags"."id" = "ticket_tags"."tag_id" WHERE "ticket_tags"."ticket_id" = ?  [["ticket_id", 17]]
---
  def ticket_tag_names(ticket)
    ticket.tags.map{|tag| tag.name}.join(", ")