ticketing_application/app/views/projects/_project.html.erb

  </td>
  <td class="tg-01ax"><%= project.tickets.open.count %></td>
  <td class="tg-01ax"><%= project.tickets.count %></td>
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = ?  [["project_id", 12]]
SELECT COUNT(*) FROM "tickets" WHERE "tickets"."project_id" = ? AND (status != 'fixed')  [["project_id", 12]]